rules.org
#+TITLE: Quidditch 游戏规则
#+author: 钱泽森(5130379069)

* 在一个正方形的球桌上, 有四类球
  - GhostBall :: 幽灵球, 是最普通的球. 在不受到外力的情况下, 在球桌的
                 摩擦力下会慢慢减速直到停止.
  - CueBall :: 等同于幽灵球, 但是玩家可以控制. 
  - WanderBall :: 游走球, 自带动力. 即使没有受到外力的情况下也会慢慢游
                  走. 会尽量避让别的球, 但是如果收到撞击后加速可能会碰
                  到别的球.
  - SnitchBall :: 金色飞贼, 长期在球桌上空随机飞行, 但是会周期性(暂定
                  10秒)地掉落到球桌上(沉睡). 沉睡状态下受到CueBall的撞击, 或者
                  沉睡一定时间(暂定10秒)后, 会再次离开球桌.
* 玩家控制
  玩家可以控制CueBall. 玩家通过鼠标移动来控制球杆方向, 鼠标按键的时间长短
  来控制力度. 松开鼠标按键后, 球杆即会撞击CueBall,并接着撞击其他球.
* 积分规则
  玩家通过控制CueBall撞击别的球来得分. 各个球的分数如下:
  - GhostBall :: 1分, 因为平时是静止的, 最容易撞击.
  - WanderBall :: 2分, 因为总是在无规则游走, 比较难撞击.
  - SnitchBall :: 5分, 因为很少降落到桌面, 且沉睡时间也较短, 非常难撞
                  击.
